todolist/app/controllers/tasks_controller.rb

  def index
    @list = Task.all
---
SELECT "tasks".* FROM "tasks"

  def mark_complete
    @task = Task.find(params[:id])
    if @task and @task.update(completed: true)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", true], ["updated_at", 2018-01-19 08:12:37 UTC], ["id", 1]]

  def mark_active
    @task = Task.find(params[:id])
    if @task and @task.update(completed: false)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", false], ["updated_at", 2018-01-19 08:15:33 UTC], ["id", 1]]

  def destroy
    @post_destroy = Task.find(params[:id])

    if @post_destroy and @post_destroy.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "New Task"], ["created_at", 2018-01-19 07:58:18 UTC], ["updated_at", 2018-01-19 07:58:18 UTC]]