todolist/app/controllers/users_controller.rb

  def create
    @user = User.new(username: params[:username], password: params[:password])
    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yolo"], ["password", "stealthis"], ["created_at", 2018-01-19 12:47:01 UTC], ["updated_at", 2018-01-19 12:47:01 UTC]]