todolist/app/views/users/create.jbuilder

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yolo"], ["password", "stealthis"], ["created_at", 2018-01-19 12:47:01 UTC], ["updated_at", 2018-01-19 12:47:01 UTC]]
---
  json.password @user.password
  json.created_at @user.created_at