twitter clone/app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.order(created_at: :asc).reverse
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" ASC

  def index_by_user
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "user_1"], ["LIMIT", 1]]

  def destroy
    token = cookies.signed[:twitter_session_token]
    session = Session.find_by(token: token)
    @tweet = Tweet.find_by(id: params[:id])
    if(session and session.user_id == @tweet.user_id)
      if(@tweet.destroy)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]