twitter clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at", "salt") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(username: params[:user][:username], password: params[:user][:password], email: params[:user][:email])
    if(@user.save)